import { Link, useParams } from "react-router-dom";
import { useGetDevicesQuery } from "../../../api/device.APIs";
import "../../../public/css/admin/detail_device_page.css";

type Props = {};

const Detail_device_page = (props: Props) => {
  const { data: Devices, isLoading, error } = useGetDevicesQuery();
  const { id } = useParams();

  const device = Devices && Devices?.filter((item: any) => item?.id == id)[0];

  const deviceType = (type: any) => {
    if (type == 1) {
        return "kiosk";
    }
    return "displayer counter";
  }

  const hiddenCode = (code:any = null) => {
    if(code){
        return code.slice(0, -7) + '*******';
    }
}

  return (
    <div className="detail_device_page">
      {/* Title */}
      <div className="title_page">
        <div className="nav_number_page">
          <div className="url_nav">
            <p className="url_1">
              <Link to="../device">Thiết bị</Link>
            </p>
            <p>
              <svg
                width="6"
                height="10"
                viewBox="0 0 6 10"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M5.35833 4.40874L1.825 0.875405C1.74753 0.797298 1.65536 0.735302 1.55381 0.692995C1.45226 0.650688 1.34334 0.628906 1.23333 0.628906C1.12332 0.628906 1.0144 0.650688 0.912851 0.692995C0.811302 0.735302 0.719134 0.797298 0.641665 0.875405C0.486456 1.03154 0.399338 1.24275 0.399338 1.4629C0.399338 1.68306 0.486456 1.89427 0.641665 2.0504L3.59167 5.0004L0.641665 7.9504C0.486456 8.10654 0.399338 8.31775 0.399338 8.5379C0.399338 8.75806 0.486456 8.96927 0.641665 9.1254C0.719532 9.20264 0.811878 9.26374 0.91341 9.30521C1.01494 9.34668 1.12366 9.3677 1.23333 9.36707C1.343 9.3677 1.45172 9.34668 1.55325 9.30521C1.65478 9.26374 1.74713 9.20264 1.825 9.1254L5.35833 5.59207C5.43644 5.5146 5.49843 5.42243 5.54074 5.32088C5.58305 5.21934 5.60483 5.11041 5.60483 5.0004C5.60483 4.89039 5.58305 4.78147 5.54074 4.67992C5.49843 4.57837 5.43644 4.48621 5.35833 4.40874Z"
                  fill="#7E7D88"
                />
              </svg>
            </p>
            <p className="url_1">
              <Link to="../device">Danh sách thiết bị</Link>
            </p>
            <p>
              <svg
                width="6"
                height="10"
                viewBox="0 0 6 10"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M5.35833 4.40874L1.825 0.875405C1.74753 0.797298 1.65536 0.735302 1.55381 0.692995C1.45226 0.650688 1.34334 0.628906 1.23333 0.628906C1.12332 0.628906 1.0144 0.650688 0.912851 0.692995C0.811302 0.735302 0.719134 0.797298 0.641665 0.875405C0.486456 1.03154 0.399338 1.24275 0.399338 1.4629C0.399338 1.68306 0.486456 1.89427 0.641665 2.0504L3.59167 5.0004L0.641665 7.9504C0.486456 8.10654 0.399338 8.31775 0.399338 8.5379C0.399338 8.75806 0.486456 8.96927 0.641665 9.1254C0.719532 9.20264 0.811878 9.26374 0.91341 9.30521C1.01494 9.34668 1.12366 9.3677 1.23333 9.36707C1.343 9.3677 1.45172 9.34668 1.55325 9.30521C1.65478 9.26374 1.74713 9.20264 1.825 9.1254L5.35833 5.59207C5.43644 5.5146 5.49843 5.42243 5.54074 5.32088C5.58305 5.21934 5.60483 5.11041 5.60483 5.0004C5.60483 4.89039 5.58305 4.78147 5.54074 4.67992C5.49843 4.57837 5.43644 4.48621 5.35833 4.40874Z"
                  fill="#7E7D88"
                />
              </svg>
            </p>
            <p className="url_2">
              <Link to="">Chi tiết thiết bị</Link>
            </p>
          </div>
          <div className="user_nav">
            <button>
              <svg
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M16.1167 12.0753L15.2833 10.692C15.1083 10.3837 14.95 9.80033 14.95 9.45866V7.35033C14.95 5.39199 13.8 3.70033 12.1417 2.90866C11.7083 2.14199 10.9083 1.66699 9.99166 1.66699C9.08333 1.66699 8.26666 2.15866 7.83333 2.93366C6.20833 3.74199 5.08333 5.41699 5.08333 7.35033V9.45866C5.08333 9.80033 4.92499 10.3837 4.74999 10.6837L3.90833 12.0753C3.57499 12.6337 3.49999 13.2503 3.70833 13.817C3.90833 14.3753 4.38333 14.8087 4.99999 15.017C6.61666 15.567 8.31666 15.8337 10.0167 15.8337C11.7167 15.8337 13.4167 15.567 15.0333 15.0253C15.6167 14.8337 16.0667 14.392 16.2833 13.817C16.5 13.242 16.4417 12.6087 16.1167 12.0753Z"
                  fill="#FFAC6A"
                />
                <path
                  d="M12.3584 16.6753C12.0084 17.642 11.0834 18.3337 10 18.3337C9.34169 18.3337 8.69169 18.067 8.23336 17.592C7.96669 17.342 7.76669 17.0087 7.65002 16.667C7.75836 16.6837 7.86669 16.692 7.98336 16.7087C8.17502 16.7337 8.37502 16.7587 8.57502 16.7753C9.05002 16.817 9.53336 16.842 10.0167 16.842C10.4917 16.842 10.9667 16.817 11.4334 16.7753C11.6084 16.7587 11.7834 16.7503 11.95 16.7253C12.0834 16.7087 12.2167 16.692 12.3584 16.6753Z"
                  fill="#FFAC6A"
                />
              </svg>
            </button>
            <div className="user">
              <div className="avatar">
                <img
                  src="https://image-us.24h.com.vn/upload/4-2020/images/2020-11-11/Nu-sinh-Nhan-van-la-nguoi-mau-anh-tuoi-20-mon-mon-dep-xinh-khong-kem-dich-Le-Nhiet-Ba-107368862_2653859988196507_3262836775669550024_n-1605081022-435-width960height960.jpg"
                  width="100%"
                  alt=""
                />
              </div>
              <div className="info_user">
                <p>Xin chào</p>
                <p className="name_user">
                  <Link to="../user">Lê Quỳnh Ái Vân</Link>
                </p>
              </div>
            </div>
          </div>
        </div>
        <h4>Quản lý thiết bị</h4>
      </div>
      {/* main */}
      <div className="main_page">
        <div className="data col-11">
          <h5>Thông tin thiết bị</h5>
          <div className="detail">
            <div className="item_data">
              <b>Mã thiết bị:</b>
              <p>{ device?.device_code }</p>
            </div>
            <div className="item_data">
              <b>Loại thiết bị:</b>
              <p>{ deviceType(device?.device_type) }</p>
            </div>
            <div className="item_data">
              <b>Tên thiết bị:</b>
              <p>{ device?.device_name }</p>
            </div>
            <div className="item_data">
              <b>Tên đăng nhập:</b>
              <p>{ device?.user_name }</p>
            </div>
            <div className="item_data">
              <b>Địa chỉ IP:</b>
              <p>{ device?.ip_address }</p>
            </div>
            <div className="item_data">
              <b>Mật khẩu:</b>
              <p>{ hiddenCode(device?.user_pass) }</p>
            </div>
            <div className="item">
              <b>Dịch vụ sử dụng:</b>
              <p>
                { device?.device_service.map((item:any) => item + ', ') }
              </p>
            </div>
          </div>
        </div>
        {/* Button add */}
        <div className="button_add">
          <button>
            <Link to="../device/update/KIO_01">
              <svg
                width="28"
                height="28"
                viewBox="0 0 28 28"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M19.443 2.34507C21.1213 2.24017 22.7762 2.8229 24.0233 3.96506C25.1655 5.2121 25.7482 6.86705 25.655 8.55697V19.4424C25.7599 21.1323 25.1655 22.7873 24.035 24.0343C22.7879 25.1764 21.1213 25.7592 19.443 25.6543H8.55751C6.86758 25.7592 5.21261 25.1764 3.96556 24.0343C2.8234 22.7873 2.24066 21.1323 2.34555 19.4424V8.55697C2.24066 6.86705 2.8234 5.2121 3.96556 3.96506C5.21261 2.8229 6.86758 2.24017 8.55751 2.34507H19.443ZM12.8115 19.6522L20.6551 11.7853C21.366 11.0627 21.366 9.89725 20.6551 9.18632L19.14 7.67122C18.4174 6.94864 17.2519 6.94864 16.5293 7.67122L15.7485 8.46374C15.6319 8.58028 15.6319 8.77841 15.7485 8.89496C15.7485 8.89496 17.6016 10.7364 17.6365 10.783C17.7647 10.9229 17.8463 11.1093 17.8463 11.3191C17.8463 11.7387 17.5083 12.0883 17.0771 12.0883C16.879 12.0883 16.6925 12.0067 16.5643 11.8785L14.618 9.94387C14.5247 9.85063 14.3616 9.85063 14.2683 9.94387L8.70902 15.5031C8.32442 15.8877 8.10298 16.4005 8.09132 16.9483L8.02139 19.7104C8.02139 19.8619 8.06801 20.0018 8.17291 20.1067C8.2778 20.2116 8.41765 20.2699 8.56917 20.2699H11.308C11.8674 20.2699 12.4036 20.0484 12.8115 19.6522Z"
                  fill="#FF9138"
                />
              </svg>
              <p>Cập nhật thiết bị</p>
            </Link>
          </button>
        </div>
      </div>
    </div>
  );
};

export default Detail_device_page;
